<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%@ include file="../header.jsp" %>

<!-- sub content -->
<div class="sub_title">
	<h2>회원가입 약관</h2>
	<div class="container">
		<div class="location">
			<ul>
				<li class="btn_home">
					<a href="/main.do">
						<i class="fa fa-home btn_plus"></i>
					</a>
				</li>
				<li class="dropdown">
				<a href="">회원가입<i class="fa fa-plus btn_plus"></i></a>
					<div class="dropdown_menu">
						<a href="memberterms.do">회원가입 약관</a>
					</div>
				</li>
			</ul>
		</div>
	</div>
	<!-- container end -->
</div>

<div class="container">
	<h3 class="join_title">JOIN / 회원가입 약관</h3>
	<p class="pd30">
	<input type="checkbox" class="agreeAll" name="chkCtrl" id="chkCtrl" value="t"/>
	JSL시스템 이용약관, 개인정보 수집 및 이용, 위치기반서비스 이용약관(선택), 프로모션 정보 수신(선택)에 모두 동의합니다.
	</p>
	<textarea class="textarea_box">
이 사이트는 지상 최강의 고양이들만 올 수 있는 사이트입니다. 고양이력이 9000이 넘지 않으면 가입하실 수 없습니다.
만일 9000이 넘지 않는다면 자신을 돌아보도록 합시다. 말끝마다 냥을 붙이지 않는다고요? 그러면 이미 고양이력 마이너스입니다.
정진하십시오. 무엇 때문에 이 사이트에 가입하려고 하십니까?
이 사이트는 지상 최강의 고양이들만 올 수 있는 사이트입니다. 고양이력이 9000이 넘지 않으면 가입하실 수 없습니다.
만일 9000이 넘지 않는다면 자신을 돌아보도록 합시다. 말끝마다 냥을 붙이지 않는다고요? 그러면 이미 고양이력 마이너스입니다.
정진하십시오. 무엇 때문에 이 사이트에 가입하려고 하십니까?
이 사이트는 지상 최강의 고양이들만 올 수 있는 사이트입니다. 고양이력이 9000이 넘지 않으면 가입하실 수 없습니다.
만일 9000이 넘지 않는다면 자신을 돌아보도록 합시다. 말끝마다 냥을 붙이지 않는다고요? 그러면 이미 고양이력 마이너스입니다.
정진하십시오. 무엇 때문에 이 사이트에 가입하려고 하십니까?
이 사이트는 지상 최강의 고양이들만 올 수 있는 사이트입니다. 고양이력이 9000이 넘지 않으면 가입하실 수 없습니다.
만일 9000이 넘지 않는다면 자신을 돌아보도록 합시다. 말끝마다 냥을 붙이지 않는다고요? 그러면 이미 고양이력 마이너스입니다.
정진하십시오. 무엇 때문에 이 사이트에 가입하려고 하십니까?
이 사이트는 지상 최강의 고양이들만 올 수 있는 사이트입니다. 고양이력이 9000이 넘지 않으면 가입하실 수 없습니다.
만일 9000이 넘지 않는다면 자신을 돌아보도록 합시다. 말끝마다 냥을 붙이지 않는다고요? 그러면 이미 고양이력 마이너스입니다.
정진하십시오. 무엇 때문에 이 사이트에 가입하려고 하십니까?
이 사이트는 지상 최강의 고양이들만 올 수 있는 사이트입니다. 고양이력이 9000이 넘지 않으면 가입하실 수 없습니다.
만일 9000이 넘지 않는다면 자신을 돌아보도록 합시다. 말끝마다 냥을 붙이지 않는다고요? 그러면 이미 고양이력 마이너스입니다.
정진하십시오. 무엇 때문에 이 사이트에 가입하려고 하십니까?
이 사이트는 지상 최강의 고양이들만 올 수 있는 사이트입니다. 고양이력이 9000이 넘지 않으면 가입하실 수 없습니다.
만일 9000이 넘지 않는다면 자신을 돌아보도록 합시다. 말끝마다 냥을 붙이지 않는다고요? 그러면 이미 고양이력 마이너스입니다.
정진하십시오. 무엇 때문에 이 사이트에 가입하려고 하십니까?
이 사이트는 지상 최강의 고양이들만 올 수 있는 사이트입니다. 고양이력이 9000이 넘지 않으면 가입하실 수 없습니다.
만일 9000이 넘지 않는다면 자신을 돌아보도록 합시다. 말끝마다 냥을 붙이지 않는다고요? 그러면 이미 고양이력 마이너스입니다.
정진하십시오. 무엇 때문에 이 사이트에 가입하려고 하십니까?
야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹야옹
	</textarea>
	<p class="pd30">
	<input type="checkbox" name="agree" id="agree1" value="t"/>JSL시스템 이용약관 동의
	</p>
	<textarea class="textarea_box">
니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 니 개인정보는 전부 우리 겁니다? 꼬우신가요? 구글 페이스북도 다 합니다. 왜 우리만 못 하나요? 개불공평해~ 
	</textarea>
	<p class="pd30">
	<input type="checkbox" name="agree" id="agree2" value="t"/> 개인정보 이용 동의
	</p>
	<textarea class="textarea_box">
니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 니 위치도 다 추적합니다. 역시 구글 페이스북 애플 다 하는 짓입니다. 니가 안 잡혀가는 건 니가 덜 중요한 인간이라 그래요. 
	</textarea>
	<p class="pd30">
	<input type="checkbox" name="agree" id="agree3" value="t"/> (선택)위치기반서비스 이용약관
	</p>

	<p class="pd30" style="text-align:center;">
		<input type="button" value="취소" class="btn" id="btn_cancel" onclick="location.href='main.do'">&nbsp;&nbsp;
		<input type="button" value="약관동의" class="btn" id="btn_ok" onclick="">
	</p>

</div>

<script>
	$(document).ready(function() { // 제이쿼리 시작했다
		var chkList = $("input[name=agree]");
		// jQuery 선택자: name 속성이 agree라고 되어 있는 input 요소를 선택해서 저장하라
		$("#chkCtrl").on("click", function() { // 콜백 함수
		// id가 chkCtrl인 요소를 선택해서 . ( "click" 이벤트가 발생하면, {} 안을 실행하세요 )
		// 그래서 id 속성은 JS와의 연계에서 주로 사용하고, class 속성은 CSS와의 연계에서 주로 사용한다.
		// id는 유일하게만 쓰이기 때문에 JS에서 쓰기 편하기 때문이다.
			if($(this).is(":checked")) {
				chkList.prop("checked", true); // JS의 PROPerty를 가져와서 변경하는 것
			} else {
				chkList.prop("checked", false);
			}
		})
		
		$("#agree1, #agree2, #agree3").on("click", function() {
			if($("#agree1").is(":checked") == true 
				&& $("#agree2").is(":checked") == true 
				&& $("#agree3").is(":checked") == true) {
				$("#chkCtrl").prop("checked", true);
			} else {
				$("#chkCtrl").prop("checked", false);
			}
		})

	}) // 제이쿼리 끝났다
</script>

<%@ include file="../footer.jsp" %>